Revit 2027 API
PointIterator.IsDone Method
 Identifies if the iteration has reached the end of the collection.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsDone()
Public Function IsDone As Boolean
public:
bool IsDone()
member IsDone : unit -> bool
Return Value
Boolean
 True if the iteration has reached the end, false otherwise.
See Also
Reference
PointIterator Class
Autodesk.Revit.DB.PointClouds Namespace